# Install Pandas

In [ ]:
# !uv add pandas

# !pip install pandas

# What is Pandas?

Pandas is an open-source Python library for data manipulation and analysis. It gives you 
powerful, fast, flexible, and expressive data structures designed to work with structured data.

It is built on top of NumPy, and its name comes from â€œPanel Dataâ€ (econometrics term for multidimensional data).

# Why Pandas? What problem does it solve?

### Before Pandas:

People used raw Python lists, dictionaries, or NumPy arrays.

These structures lacked labels, indexing, grouping, join/merge, handling missing data, etc.

Real-world datasets (CSV, JSON, Excel, SQL) are structured in rows and columns â€” not arrays.

So Pandas was designed to work like:

ðŸ“Š Excel + ðŸ§® NumPy + ðŸ—‚ï¸ SQL + ðŸ§° ETL tools â€” inside Python

# âš™ï¸ Where is Pandas used?

| Field              | How Pandas Helps                                        |
| ------------------ | ------------------------------------------------------- |
| Data Science       | Load, clean, explore, transform, and model data         |
| Machine Learning   | Prepare features, preprocess, manipulate large datasets |
| Finance            | Time series, stock prices, trade records                |
| Web/Data Analytics | ETL pipelines, server logs, product usage stats         |
| Healthcare         | Patient records, diagnostics, hospital statistics       |

# ðŸ§± What does Pandas offer at its core?

| Core Object          | Description                                   |
| -------------------- | --------------------------------------------- |
| `Series`             | 1D labeled array â€” like a column              |
| `DataFrame`          | 2D table â€” like a sheet of Excel or SQL table |
| `Panel` (deprecated) | 3D data container (replaced by MultiIndex)    |

# ðŸŽ And tons of utilities:

- Reading/Writing (CSV, JSON, Excel, SQL, Parquet)

- Powerful slicing/indexing/merging

- GroupBy, pivoting, reshaping

- Time series and date handling

- Missing data handling

- Statistical functions and window operations

- Built-in plotting (with matplotlib backend)

Think of Pandas like a spreadsheet that you can program, automate, and scale â€” with the power of Python and NumPy underneath.

In [1]:
import pandas as pd

In [ ]:
# pd.Series(data)
# pd.Series(data, index=None, dtype=None, name=None, copy=False, fastpath=False)

data = [1,2,3,4,5,6]

s1 = pd.Series(data)

In [3]:
print(s1)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [4]:
s2 = pd.Series(data, index=['a', 'b', 'c', 'd', 'e', 'f'], name='Numbers')

In [5]:
print(s2)

a    1
b    2
c    3
d    4
e    5
f    6
Name: Numbers, dtype: int64

In [6]:
data = {'a': 10, 'b': 20, 'c': 30}
s3 = pd.Series(data)
print(s3)

a    10
b    20
c    30
dtype: int64

In [7]:
# Create Series from NumPy array
import numpy as np

In [8]:
arr = np.array([5, 10, 15])
s4 = pd.Series(arr, index=['x', 'y', 'z'])
print(s4)

x     5
y    10
z    15
dtype: int64

In [20]:
#  Series Attributes & Properties

s2 = pd.Series([10, 20, 30, 40], index=['a', 'b', 'c', 'd'], name='Scores')

In [25]:
print(s2)
print(s2.index)     # Index object
print(s2.values)    # NumPy array of values
print(s2.dtype)     # Data type
print(s2.name)      # Name of the Series
print(s2.shape) 
type(s2.shape)

a    10
b    20
c    30
d    40
Name: Scores, dtype: int64
Index(['a', 'b', 'c', 'd'], dtype='str')
[10 20 30 40]
int64
Scores
(4,)

tuple

#### Series Indexing & Access

In [ ]:
# 1. Positional Indexing
# [10 20 30 40]
print(s2.values[0])
print(s2.values[3])

10
40

In [ ]:
# iloc gets rows (and/or columns) at integer locations.

print(s2.iloc[0])

10

In [32]:
print(s2.iloc[1:3])

b    20
c    30
Name: Scores, dtype: int64

In [33]:
# 2. Label-based Indexing

# loc gets rows (and/or columns) with particular labels.

In [ ]:
# Pandas resolves s2[0] in the following order:

# Check if 0 is a label in the index
# â†’ If yes, return by label

# If not, and if the index is not integer-based, then treat 0 as a position
# â†’ Return item at index position 0 (first element)

# FutureWarning: Series.__getitem__ treating keys as positions is deprecated. 
# In a future version, integer keys will always be treated as 
# labels (consistent with DataFrame behavior). 
# To access a value by position, use `ser.iloc[pos]`

print(s2[0])

KeyError: 0

In [35]:
print(s2['a'])

10

In [36]:
print(s2['b'])

20

In [ ]:
# .loc[] uses the label/index name, not position.

In [37]:
print(s2[['b', 'd']])

b    20
d    40
Name: Scores, dtype: int64

In [38]:
print(s2.loc[['b', 'd']])

b    20
d    40
Name: Scores, dtype: int64

In [39]:
s3 = pd.Series([10, 20, 30, 40])

In [40]:
s3.iloc[[1,2]]

1    20
2    30
dtype: int64

In [41]:
s3.iloc[1:3]

1    20
2    30
dtype: int64

In [42]:
s3.loc[[1,2]]

1    20
2    30
dtype: int64

# 2. What is a DataFrame?

A DataFrame is a 2D labeled data structure with columns of potentially different types, just like a spreadsheet or SQL table.

Think of it like:

- A dict of Series

- Or a table with rows and columns

It is the core structure of pandas used for:

- Reading, cleaning, transforming, analyzing, and exporting data


### Why DataFrame?

Real-world data is usually tabular (e.g., CSV, Excel, SQL)

Rows = records

Columns = features

It supports label-based indexing, automatic alignment, missing data handling, grouping, aggregation, and more


| Concept     | Real-Life Analogy             |
| ----------- | ----------------------------- |
| `DataFrame` | Excel sheet or database table |
| `Series`    | One column of that sheet      |
| Index       | Row number or ID              |
| Columns     | Named headers                 |

In [ ]:
# From a dictionary of lists

data = {
    'Name' : ['Hemanth', 'Aditya', 'rajbeer'],
    'Age' : [30, 31, 32],
    'City' : ['Delhi', 'Mumbai', 'Bangalore']
}

In [45]:
df = pd.DataFrame(data)

In [46]:
print(df)

      Name  Age       City
0  Hemanth   30      Delhi
1   Aditya   31     Mumbai
2  rajbeer   32  Bangalore

In [47]:
df

      Name  Age       City
0  Hemanth   30      Delhi
1   Aditya   31     Mumbai
2  rajbeer   32  Bangalore

In [49]:
# From a list of dicts

records = [
    {'Name' : 'Hemanth', 'Age' : 30, 'City' : 'Delhi'},
    {'Name' : 'Aditya', 'Age' : 31, 'City' : 'Mumbai'},
    {'Name' : 'Rajbeer', 'Age' : 32, 'City' : 'Bangalore'}
]

df = pd.DataFrame(records)
print(df)

      Name  Age       City
0  Hemanth   30      Delhi
1   Aditya   31     Mumbai
2  Rajbeer   32  Bangalore

In [50]:
# From NumPy arrays (if all columns are of the same type)

arr = np.array([[1, 2], [3, 4], [5, 6]])
df = pd.DataFrame(arr, columns=['A', 'B'])
print(df)

   A  B
0  1  2
1  3  4
2  5  6

In [51]:
# Accessing Data

data = {
    'Name' : ['Hemanth', 'Aditya', 'rajbeer'],
    'Age' : [30, 31, 32],
    'City' : ['Delhi', 'Mumbai', 'Bangalore']
}

df = pd.DataFrame(data)

In [54]:
df

      Name  Age       City
0  Hemanth   30      Delhi
1   Aditya   31     Mumbai
2  rajbeer   32  Bangalore

In [ ]:
print(df['Name']) # Series (a column)
print("===========")
print(df[['Name', 'Age']]) # DataFrame with two columns
print("===========")
print(df.iloc[0]) # Row by integer index label or position
print("===========")
print(df.loc[0])  # Row by index label

0    Hemanth
1     Aditya
2    rajbeer
Name: Name, dtype: str
===========
      Name  Age
0  Hemanth   30
1   Aditya   31
2  rajbeer   32
===========
Name    Hemanth
Age          30
City      Delhi
Name: 0, dtype: object
===========
Name    Hemanth
Age          30
City      Delhi
Name: 0, dtype: object

# Working with real dataset

In [57]:
# https://github.com/datasciencedojo/datasets
titanic_dataset_github_url = "https://raw.githubusercontent.com/datasciencedojo/datasets/refs/heads/master/titanic.csv"

# https://github.com/mwaskom/seaborn-data/tree/master

iris_dataset_github_url = "https://raw.githubusercontent.com/mwaskom/seaborn-data/refs/heads/master/iris.csv"

# kaggle
kaggle_link = "https://www.kaggle.com/datasets/yasserh/titanic-dataset/data"

In [58]:
df = pd.read_csv(titanic_dataset_github_url)

In [59]:
print(df.head())

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

In [62]:
print(df.head())
print(df.head(3))

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S
   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S

In [63]:
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [65]:
display(df.head(3))
display(df.head(1))

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [66]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='str')

In [69]:
df[["Name" , 'Age']]

                                                  Name   Age
0                              Braund, Mr. Owen Harris  22.0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                               Heikkinen, Miss. Laina  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                             Allen, Mr. William Henry  35.0
..                                                 ...   ...
886                              Montvila, Rev. Juozas  27.0
887                       Graham, Miss. Margaret Edith  19.0
888           Johnston, Miss. Catherine Helen "Carrie"   NaN
889                              Behr, Mr. Karl Howell  26.0
890                                Dooley, Mr. Patrick  32.0

[891 rows x 2 columns]

In [70]:
df.loc[0]

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                               22.0
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

In [74]:
df.loc[0]['Name']

'Braund, Mr. Owen Harris'

In [75]:
df.loc[0, 'Name']

'Braund, Mr. Owen Harris'

In [76]:
# First row
df.iloc[0]

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                               22.0
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

In [77]:
# First 5 rows
df.iloc[:5]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [80]:
df.iloc[0, 3]

'Braund, Mr. Owen Harris'

In [82]:
df.iloc[0:5, 3]

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
Name: Name, dtype: str

# Loading from local csv file

In [83]:
titanic_dataset_local_url = "titanic.csv"
df = pd.read_csv(titanic_dataset_local_url)

In [84]:
df.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [ ]:
# Assignment-1

# I want you to download below csv using python

# create a class

# create a object of that class and call the obj.download(URL, path_to_download="data")

# you are not suppose to use pandas or numpy

# Only use python and libraries like request and other

# titanic_dataset_github_url = "https://raw.githubusercontent.com/datasciencedojo/datasets/refs/heads/master/titanic.csv"

# 5. Conditional Selection (Boolean Indexing)

In [85]:
# Passengers older than 70

df['Age'] > 70 # Boolean index of passengers > 70 (True) else False

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: Age, Length: 891, dtype: bool

In [86]:
df[df['Age'] > 70]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S

In [87]:
older_passengers = df[df['Age'] > 70]
display(older_passengers.head())

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S

In [88]:
older_passengers.shape

(5, 12)

In [89]:
older_passengers.info()

<class 'pandas.DataFrame'>
Index: 5 entries, 96 to 851
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  5 non-null      int64
 1   Survived     5 non-null      int64
 2   Pclass       5 non-null      int64
 3   Name         5 non-null      str
 4   Sex          5 non-null      str
 5   Age          5 non-null      float64
 6   SibSp        5 non-null      int64
 7   Parch        5 non-null      int64
 8   Ticket       5 non-null      str
 9   Fare         5 non-null      float64
 10  Cabin        2 non-null      str
 11  Embarked     5 non-null      str
dtypes: float64(2), int64(5), str(5)
memory usage: 520.0 bytes

In [90]:
older_passengers.describe()

       PassengerId  Survived    Pclass        Age  SibSp  Parch       Fare
count     5.000000  5.000000  5.000000   5.000000    5.0    5.0   5.000000
mean    438.200000  0.200000  1.800000  73.300000    0.0    0.0  25.936680
std     328.292096  0.447214  1.095445   3.993745    0.0    0.0  18.086844
min      97.000000  0.000000  1.000000  70.500000    0.0    0.0   7.750000
25%     117.000000  0.000000  1.000000  71.000000    0.0    0.0   7.775000
50%     494.000000  0.000000  1.000000  71.000000    0.0    0.0  30.000000
75%     631.000000  0.000000  3.000000  74.000000    0.0    0.0  34.654200
max     852.000000  1.000000  3.000000  80.000000    0.0    0.0  49.504200

In [91]:
older_passengers['PassengerId'].describe()

count      5.000000
mean     438.200000
std      328.292096
min       97.000000
25%      117.000000
50%      494.000000
75%      631.000000
max      852.000000
Name: PassengerId, dtype: float64

In [92]:
# Females who survived
# Sex = female AND survived = 1

df[(df['Sex'] == 'female') & (df['Survived'] == 1)] # --> True / False

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
874,875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.0000,NaN,C
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S

In [95]:
# get Name & Age of Females who survived
# df[["Name" , 'Age']]
female_survivors_subset = df[(df['Sex'] == 'female') & (df['Survived'] == 1)][['Name', 'Age']]
female_survivors_subset.head()

                                                Name   Age
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                             Heikkinen, Miss. Laina  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
8  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  27.0
9                Nasser, Mrs. Nicholas (Adele Achem)  14.0

In [96]:
# get Name & Age of Females who survived using loc

# df.loc[label, ['Name', 'Age']]

df.loc[(df['Sex'] == 'female') & (df['Survived'] == 1), ['Name', 'Age']]

                                                  Name   Age
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                               Heikkinen, Miss. Laina  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  27.0
9                  Nasser, Mrs. Nicholas (Adele Achem)  14.0
..                                                 ...   ...
874              Abelson, Mrs. Samuel (Hannah Wizosky)  28.0
875                   Najib, Miss. Adele Kiamie "Jane"  15.0
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  56.0
880       Shelley, Mrs. William (Imanita Parrish Hall)  25.0
887                       Graham, Miss. Margaret Edith  19.0

[233 rows x 2 columns]

# 6. Slicing Rows and Columns Together

In [ ]:
# Rows 0 to 4, only Name and Age
# df.loc[0:4, ['Name', 'Age']]
df.loc[:4, ['Name', 'Age']]

                                                Name   Age
0                            Braund, Mr. Owen Harris  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                             Heikkinen, Miss. Laina  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                           Allen, Mr. William Henry  35.0

In [100]:
# First 3 rows and first 2 columns
# df.iloc[:3, :2]
df.iloc[0:3, 0:2]

   PassengerId  Survived
0            1         0
1            2         1
2            3         1

In [101]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [102]:
# First 3 rows and column Name as the first column and then then Survived column

df.iloc[0:3, [3, 1]]

                                                Name  Survived
0                            Braund, Mr. Owen Harris         0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...         1
2                             Heikkinen, Miss. Laina         1

In [105]:
df.loc[0:3, ['Name', 'Survived']]

                                                Name  Survived
0                            Braund, Mr. Owen Harris         0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...         1
2                             Heikkinen, Miss. Laina         1
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)         1

In [106]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# Set Index (Optional)

In [107]:
df_by_passenger_id = df.set_index('PassengerId')

In [108]:
df_by_passenger_id.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [109]:
df_by_passenger_id.iloc[0]

Survived                          0
Pclass                            3
Name        Braund, Mr. Owen Harris
Sex                            male
Age                            22.0
SibSp                             1
Parch                             0
Ticket                    A/5 21171
Fare                           7.25
Cabin                           NaN
Embarked                          S
Name: 1, dtype: object

In [111]:
df_by_passenger_id.loc[1]

Survived                          0
Pclass                            3
Name        Braund, Mr. Owen Harris
Sex                            male
Age                            22.0
SibSp                             1
Parch                             0
Ticket                    A/5 21171
Fare                           7.25
Cabin                           NaN
Embarked                          S
Name: 1, dtype: object

In [114]:
df_by_passenger_id = df_by_passenger_id.reset_index()

In [115]:
df_by_passenger_id.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S